zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43L43Z92/KW43L43Z92_COMMON.h
/* BTRTU1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral BTRTU1 base address */
  #define BTRTU1_BASE                              (0x5010B400u)
  /** Peripheral BTRTU1 base address */
  #define BTRTU1_BASE_NS                           (0x4010B400u)
  /** Peripheral BTRTU1 base pointer */
  #define BTRTU1                                   ((BTRTU1_Type *)BTRTU1_BASE)
  /** Peripheral BTRTU1 base pointer */
  #define BTRTU1_NS                                ((BTRTU1_Type *)BTRTU1_BASE_NS)
  /** Array initializer of BTRTU1 peripheral base addresses */
  #define BTRTU1_BASE_ADDRS                        { BTRTU1_BASE }
  /** Array initializer of BTRTU1 peripheral base pointers */
  #define BTRTU1_BASE_PTRS                         { BTRTU1 }
  /** Array initializer of BTRTU1 peripheral base addresses */
  #define BTRTU1_BASE_ADDRS_NS                     { BTRTU1_BASE_NS }
  /** Array initializer of BTRTU1 peripheral base pointers */
  #define BTRTU1_BASE_PTRS_NS                      { BTRTU1_NS }
#else
  /** Peripheral BTRTU1 base address */
  #define BTRTU1_BASE                              (0x4010B400u)
  /** Peripheral BTRTU1 base pointer */
  #define BTRTU1                                   ((BTRTU1_Type *)BTRTU1_BASE)
  /** Array initializer of BTRTU1 peripheral base addresses */
  #define BTRTU1_BASE_ADDRS                        { BTRTU1_BASE }
  /** Array initializer of BTRTU1 peripheral base pointers */
  #define BTRTU1_BASE_PTRS                         { BTRTU1 }
#endif

/* BTU2 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral BTU2 base address */
  #define BTU2_BASE                                (0x50110000u)
  /** Peripheral BTU2 base address */
  #define BTU2_BASE_NS                             (0x40110000u)
  /** Peripheral BTU2 base pointer */
  #define BTU2                                     ((BTU2_Type *)BTU2_BASE)
  /** Peripheral BTU2 base pointer */
  #define BTU2_NS                                  ((BTU2_Type *)BTU2_BASE_NS)
  /** Array initializer of BTU2 peripheral base addresses */
  #define BTU2_BASE_ADDRS                          { BTU2_BASE }
  /** Array initializer of BTU2 peripheral base pointers */
  #define BTU2_BASE_PTRS                           { BTU2 }
  /** Array initializer of BTU2 peripheral base addresses */
  #define BTU2_BASE_ADDRS_NS                       { BTU2_BASE_NS }
  /** Array initializer of BTU2 peripheral base pointers */
  #define BTU2_BASE_PTRS_NS                        { BTU2_NS }
#else
  /** Peripheral BTU2 base address */
  #define BTU2_BASE                                (0x40110000u)
  /** Peripheral BTU2 base pointer */
  #define BTU2                                     ((BTU2_Type *)BTU2_BASE)
  /** Array initializer of BTU2 peripheral base addresses */
  #define BTU2_BASE_ADDRS                          { BTU2_BASE }
  /** Array initializer of BTU2 peripheral base pointers */
  #define BTU2_BASE_PTRS                           { BTU2 }
#endif

/* BTU2_REG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral BTU2_REG base address */
  #define BTU2_REG_BASE                            (0x50110000u)
  /** Peripheral BTU2_REG base address */
  #define BTU2_REG_BASE_NS                         (0x40110000u)
  /** Peripheral BTU2_REG base pointer */
  #define BTU2_REG                                 ((BTU2_REG_Type *)BTU2_REG_BASE)
  /** Peripheral BTU2_REG base pointer */
  #define BTU2_REG_NS                              ((BTU2_REG_Type *)BTU2_REG_BASE_NS)
  /** Array initializer of BTU2_REG peripheral base addresses */
  #define BTU2_REG_BASE_ADDRS                      { BTU2_REG_BASE }
  /** Array initializer of BTU2_REG peripheral base pointers */
  #define BTU2_REG_BASE_PTRS                       { BTU2_REG }
  /** Array initializer of BTU2_REG peripheral base addresses */
  #define BTU2_REG_BASE_ADDRS_NS                   { BTU2_REG_BASE_NS }
  /** Array initializer of BTU2_REG peripheral base pointers */
  #define BTU2_REG_BASE_PTRS_NS                    { BTU2_REG_NS }
#else
  /** Peripheral BTU2_REG base address */
  #define BTU2_REG_BASE                            (0x40110000u)
  /** Peripheral BTU2_REG base pointer */
  #define BTU2_REG                                 ((BTU2_REG_Type *)BTU2_REG_BASE)
  /** Array initializer of BTU2_REG peripheral base addresses */
  #define BTU2_REG_BASE_ADDRS                      { BTU2_REG_BASE }
  /** Array initializer of BTU2_REG peripheral base pointers */
  #define BTU2_REG_BASE_PTRS                       { BTU2_REG }
#endif

/* CCM32K - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CCM32K_0 base address */
  #define CCM32K_0_BASE                            (0x5018A000u)
  /** Peripheral CCM32K_0 base address */
  #define CCM32K_0_BASE_NS                         (0x4018A000u)
  /** Peripheral CCM32K_0 base pointer */
  #define CCM32K_0                                 ((CCM32K_Type *)CCM32K_0_BASE)
  /** Peripheral CCM32K_0 base pointer */
  #define CCM32K_0_NS                              ((CCM32K_Type *)CCM32K_0_BASE_NS)
  /** Array initializer of CCM32K peripheral base addresses */
  #define CCM32K_BASE_ADDRS                        { CCM32K_0_BASE }
  /** Array initializer of CCM32K peripheral base pointers */
  #define CCM32K_BASE_PTRS                         { CCM32K_0 }
  /** Array initializer of CCM32K peripheral base addresses */
  #define CCM32K_BASE_ADDRS_NS                     { CCM32K_0_BASE_NS }
  /** Array initializer of CCM32K peripheral base pointers */
  #define CCM32K_BASE_PTRS_NS                      { CCM32K_0_NS }
#else
  /** Peripheral CCM32K_0 base address */
  #define CCM32K_0_BASE                            (0x4018A000u)
  /** Peripheral CCM32K_0 base pointer */
  #define CCM32K_0                                 ((CCM32K_Type *)CCM32K_0_BASE)
  /** Array initializer of CCM32K peripheral base addresses */
  #define CCM32K_BASE_ADDRS                        { CCM32K_0_BASE }
  /** Array initializer of CCM32K peripheral base pointers */
  #define CCM32K_BASE_PTRS                         { CCM32K_0 }
#endif

/* CDOG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CDOG_0 base address */
  #define CDOG_0_BASE                              (0x500B8000u)
  /** Peripheral CDOG_0 base address */
  #define CDOG_0_BASE_NS                           (0x400B8000u)
  /** Peripheral CDOG_0 base pointer */
  #define CDOG_0                                   ((CDOG_Type *)CDOG_0_BASE)
  /** Peripheral CDOG_0 base pointer */
  #define CDOG_0_NS                                ((CDOG_Type *)CDOG_0_BASE_NS)
  /** Peripheral CDOG_1 base address */
  #define CDOG_1_BASE                              (0x50130000u)
  /** Peripheral CDOG_1 base address */
  #define CDOG_1_BASE_NS                           (0x40130000u)
  /** Peripheral CDOG_1 base pointer */
  #define CDOG_1                                   ((CDOG_Type *)CDOG_1_BASE)
  /** Peripheral CDOG_1 base pointer */
  #define CDOG_1_NS                                ((CDOG_Type *)CDOG_1_BASE_NS)
  /** Array initializer of CDOG peripheral base addresses */
  #define CDOG_BASE_ADDRS                          { CDOG_0_BASE, CDOG_1_BASE }
  /** Array initializer of CDOG peripheral base pointers */
  #define CDOG_BASE_PTRS                           { CDOG_0, CDOG_1 }
  /** Array initializer of CDOG peripheral base addresses */
  #define CDOG_BASE_ADDRS_NS                       { CDOG_0_BASE_NS, CDOG_1_BASE_NS }
  /** Array initializer of CDOG peripheral base pointers */
  #define CDOG_BASE_PTRS_NS                        { CDOG_0_NS, CDOG_1_NS }
#else
  /** Peripheral CDOG_0 base address */
  #define CDOG_0_BASE                              (0x400B8000u)
  /** Peripheral CDOG_0 base pointer */
  #define CDOG_0                                   ((CDOG_Type *)CDOG_0_BASE)
  /** Peripheral CDOG_1 base address */
  #define CDOG_1_BASE                              (0x40130000u)
  /** Peripheral CDOG_1 base pointer */
  #define CDOG_1                                   ((CDOG_Type *)CDOG_1_BASE)
  /** Array initializer of CDOG peripheral base addresses */
  #define CDOG_BASE_ADDRS                          { CDOG_0_BASE, CDOG_1_BASE }
  /** Array initializer of CDOG peripheral base pointers */
  #define CDOG_BASE_PTRS                           { CDOG_0, CDOG_1 }
#endif
/** Interrupt vectors for the CDOG peripheral type */
#define CDOG_IRQS                                { CDOG0_IRQn, CDOG1_IRQn }

/* CIU2 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CIU2 base address */
  #define CIU2_BASE                                (0x5010A000u)
  /** Peripheral CIU2 base address */
  #define CIU2_BASE_NS                             (0x4010A000u)
  /** Peripheral CIU2 base pointer */
  #define CIU2                                     ((CIU2_Type *)CIU2_BASE)
  /** Peripheral CIU2 base pointer */
  #define CIU2_NS                                  ((CIU2_Type *)CIU2_BASE_NS)
  /** Array initializer of CIU2 peripheral base addresses */
  #define CIU2_BASE_ADDRS                          { CIU2_BASE }
  /** Array initializer of CIU2 peripheral base pointers */
  #define CIU2_BASE_PTRS                           { CIU2 }
  /** Array initializer of CIU2 peripheral base addresses */
  #define CIU2_BASE_ADDRS_NS                       { CIU2_BASE_NS }
  /** Array initializer of CIU2 peripheral base pointers */
  #define CIU2_BASE_PTRS_NS                        { CIU2_NS }
#else
  /** Peripheral CIU2 base address */
  #define CIU2_BASE                                (0x4010A000u)
  /** Peripheral CIU2 base pointer */
  #define CIU2                                     ((CIU2_Type *)CIU2_BASE)
  /** Array initializer of CIU2 peripheral base addresses */
  #define CIU2_BASE_ADDRS                          { CIU2_BASE }
  /** Array initializer of CIU2 peripheral base pointers */
  #define CIU2_BASE_PTRS                           { CIU2 }
#endif

/* CMC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMC_0 base address */
  #define CMC_0_BASE                               (0x50181000u)
  /** Peripheral CMC_0 base address */
  #define CMC_0_BASE_NS                            (0x40181000u)
  /** Peripheral CMC_0 base pointer */
  #define CMC_0                                    ((CMC_Type *)CMC_0_BASE)
  /** Peripheral CMC_0 base pointer */
  #define CMC_0_NS                                 ((CMC_Type *)CMC_0_BASE_NS)
  /** Array initializer of CMC peripheral base addresses */
  #define CMC_BASE_ADDRS                           { CMC_0_BASE }
  /** Array initializer of CMC peripheral base pointers */
  #define CMC_BASE_PTRS                            { CMC_0 }
  /** Array initializer of CMC peripheral base addresses */
  #define CMC_BASE_ADDRS_NS                        { CMC_0_BASE_NS }
  /** Array initializer of CMC peripheral base pointers */
  #define CMC_BASE_PTRS_NS                         { CMC_0_NS }
#else
  /** Peripheral CMC_0 base address */
  #define CMC_0_BASE                               (0x40181000u)
  /** Peripheral CMC_0 base pointer */
  #define CMC_0                                    ((CMC_Type *)CMC_0_BASE)
  /** Array initializer of CMC peripheral base addresses */
  #define CMC_BASE_ADDRS                           { CMC_0_BASE }
  /** Array initializer of CMC peripheral base pointers */
  #define CMC_BASE_PTRS                            { CMC_0 }
#endif

