zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43L43Z92/KW43L43Z92_COMMON.h
/* MU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MU_0__MUA base address */
  #define MU_0__MUA_BASE                           (0x50192000u)
  /** Peripheral MU_0__MUA base address */
  #define MU_0__MUA_BASE_NS                        (0x40192000u)
  /** Peripheral MU_0__MUA base pointer */
  #define MU_0__MUA                                ((MU_Type *)MU_0__MUA_BASE)
  /** Peripheral MU_0__MUA base pointer */
  #define MU_0__MUA_NS                             ((MU_Type *)MU_0__MUA_BASE_NS)
  /** Peripheral MU_0__MUB base address */
  #define MU_0__MUB_BASE                           (0x50193000u)
  /** Peripheral MU_0__MUB base address */
  #define MU_0__MUB_BASE_NS                        (0x40193000u)
  /** Peripheral MU_0__MUB base pointer */
  #define MU_0__MUB                                ((MU_Type *)MU_0__MUB_BASE)
  /** Peripheral MU_0__MUB base pointer */
  #define MU_0__MUB_NS                             ((MU_Type *)MU_0__MUB_BASE_NS)
  /** Peripheral MU_1__MUA base address */
  #define MU_1__MUA_BASE                           (0x50037000u)
  /** Peripheral MU_1__MUA base address */
  #define MU_1__MUA_BASE_NS                        (0x40037000u)
  /** Peripheral MU_1__MUA base pointer */
  #define MU_1__MUA                                ((MU_Type *)MU_1__MUA_BASE)
  /** Peripheral MU_1__MUA base pointer */
  #define MU_1__MUA_NS                             ((MU_Type *)MU_1__MUA_BASE_NS)
  /** Peripheral MU_1__MUB base address */
  #define MU_1__MUB_BASE                           (0x50038000u)
  /** Peripheral MU_1__MUB base address */
  #define MU_1__MUB_BASE_NS                        (0x40038000u)
  /** Peripheral MU_1__MUB base pointer */
  #define MU_1__MUB                                ((MU_Type *)MU_1__MUB_BASE)
  /** Peripheral MU_1__MUB base pointer */
  #define MU_1__MUB_NS                             ((MU_Type *)MU_1__MUB_BASE_NS)
  /** Array initializer of MU peripheral base addresses */
  #define MU_BASE_ADDRS                            { MU_0__MUA_BASE, MU_0__MUB_BASE, MU_1__MUA_BASE, MU_1__MUB_BASE }
  /** Array initializer of MU peripheral base pointers */
  #define MU_BASE_PTRS                             { MU_0__MUA, MU_0__MUB, MU_1__MUA, MU_1__MUB }
  /** Array initializer of MU peripheral base addresses */
  #define MU_BASE_ADDRS_NS                         { MU_0__MUA_BASE_NS, MU_0__MUB_BASE_NS, MU_1__MUA_BASE_NS, MU_1__MUB_BASE_NS }
  /** Array initializer of MU peripheral base pointers */
  #define MU_BASE_PTRS_NS                          { MU_0__MUA_NS, MU_0__MUB_NS, MU_1__MUA_NS, MU_1__MUB_NS }
#else
  /** Peripheral MU_0__MUA base address */
  #define MU_0__MUA_BASE                           (0x40192000u)
  /** Peripheral MU_0__MUA base pointer */
  #define MU_0__MUA                                ((MU_Type *)MU_0__MUA_BASE)
  /** Peripheral MU_0__MUB base address */
  #define MU_0__MUB_BASE                           (0x40193000u)
  /** Peripheral MU_0__MUB base pointer */
  #define MU_0__MUB                                ((MU_Type *)MU_0__MUB_BASE)
  /** Peripheral MU_1__MUA base address */
  #define MU_1__MUA_BASE                           (0x40037000u)
  /** Peripheral MU_1__MUA base pointer */
  #define MU_1__MUA                                ((MU_Type *)MU_1__MUA_BASE)
  /** Peripheral MU_1__MUB base address */
  #define MU_1__MUB_BASE                           (0x40038000u)
  /** Peripheral MU_1__MUB base pointer */
  #define MU_1__MUB                                ((MU_Type *)MU_1__MUB_BASE)
  /** Array initializer of MU peripheral base addresses */
  #define MU_BASE_ADDRS                            { MU_0__MUA_BASE, MU_0__MUB_BASE, MU_1__MUA_BASE, MU_1__MUB_BASE }
  /** Array initializer of MU peripheral base pointers */
  #define MU_BASE_PTRS                             { MU_0__MUA, MU_0__MUB, MU_1__MUA, MU_1__MUB }
#endif

/* PKC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PKC base address */
  #define PKC_BASE                                 (0x50023000u)
  /** Peripheral PKC base address */
  #define PKC_BASE_NS                              (0x40023000u)
  /** Peripheral PKC base pointer */
  #define PKC                                      ((PKC_Type *)PKC_BASE)
  /** Peripheral PKC base pointer */
  #define PKC_NS                                   ((PKC_Type *)PKC_BASE_NS)
  /** Array initializer of PKC peripheral base addresses */
  #define PKC_BASE_ADDRS                           { PKC_BASE }
  /** Array initializer of PKC peripheral base pointers */
  #define PKC_BASE_PTRS                            { PKC }
  /** Array initializer of PKC peripheral base addresses */
  #define PKC_BASE_ADDRS_NS                        { PKC_BASE_NS }
  /** Array initializer of PKC peripheral base pointers */
  #define PKC_BASE_PTRS_NS                         { PKC_NS }
#else
  /** Peripheral PKC base address */
  #define PKC_BASE                                 (0x40023000u)
  /** Peripheral PKC base pointer */
  #define PKC                                      ((PKC_Type *)PKC_BASE)
  /** Array initializer of PKC peripheral base addresses */
  #define PKC_BASE_ADDRS                           { PKC_BASE }
  /** Array initializer of PKC peripheral base pointers */
  #define PKC_BASE_PTRS                            { PKC }
#endif

/* PORT - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PORT_A base address */
  #define PORT_A_BASE                              (0x50197000u)
  /** Peripheral PORT_A base address */
  #define PORT_A_BASE_NS                           (0x40197000u)
  /** Peripheral PORT_A base pointer */
  #define PORT_A                                   ((PORT_Type *)PORT_A_BASE)
  /** Peripheral PORT_A base pointer */
  #define PORT_A_NS                                ((PORT_Type *)PORT_A_BASE_NS)
  /** Peripheral PORT_B base address */
  #define PORT_B_BASE                              (0x5002D000u)
  /** Peripheral PORT_B base address */
  #define PORT_B_BASE_NS                           (0x4002D000u)
  /** Peripheral PORT_B base pointer */
  #define PORT_B                                   ((PORT_Type *)PORT_B_BASE)
  /** Peripheral PORT_B base pointer */
  #define PORT_B_NS                                ((PORT_Type *)PORT_B_BASE_NS)
  /** Peripheral PORT_C base address */
  #define PORT_C_BASE                              (0x5002E000u)
  /** Peripheral PORT_C base address */
  #define PORT_C_BASE_NS                           (0x4002E000u)
  /** Peripheral PORT_C base pointer */
  #define PORT_C                                   ((PORT_Type *)PORT_C_BASE)
  /** Peripheral PORT_C base pointer */
  #define PORT_C_NS                                ((PORT_Type *)PORT_C_BASE_NS)
  /** Peripheral PORT_D base address */
  #define PORT_D_BASE                              (0x50195000u)
  /** Peripheral PORT_D base address */
  #define PORT_D_BASE_NS                           (0x40195000u)
  /** Peripheral PORT_D base pointer */
  #define PORT_D                                   ((PORT_Type *)PORT_D_BASE)
  /** Peripheral PORT_D base pointer */
  #define PORT_D_NS                                ((PORT_Type *)PORT_D_BASE_NS)
  /** Array initializer of PORT peripheral base addresses */
  #define PORT_BASE_ADDRS                          { PORT_A_BASE, PORT_B_BASE, PORT_C_BASE, PORT_D_BASE }
  /** Array initializer of PORT peripheral base pointers */
  #define PORT_BASE_PTRS                           { PORT_A, PORT_B, PORT_C, PORT_D }
  /** Array initializer of PORT peripheral base addresses */
  #define PORT_BASE_ADDRS_NS                       { PORT_A_BASE_NS, PORT_B_BASE_NS, PORT_C_BASE_NS, PORT_D_BASE_NS }
  /** Array initializer of PORT peripheral base pointers */
  #define PORT_BASE_PTRS_NS                        { PORT_A_NS, PORT_B_NS, PORT_C_NS, PORT_D_NS }
#else
  /** Peripheral PORT_A base address */
  #define PORT_A_BASE                              (0x40197000u)
  /** Peripheral PORT_A base pointer */
  #define PORT_A                                   ((PORT_Type *)PORT_A_BASE)
  /** Peripheral PORT_B base address */
  #define PORT_B_BASE                              (0x4002D000u)
  /** Peripheral PORT_B base pointer */
  #define PORT_B                                   ((PORT_Type *)PORT_B_BASE)
  /** Peripheral PORT_C base address */
  #define PORT_C_BASE                              (0x4002E000u)
  /** Peripheral PORT_C base pointer */
  #define PORT_C                                   ((PORT_Type *)PORT_C_BASE)
  /** Peripheral PORT_D base address */
  #define PORT_D_BASE                              (0x40195000u)
  /** Peripheral PORT_D base pointer */
  #define PORT_D                                   ((PORT_Type *)PORT_D_BASE)
  /** Array initializer of PORT peripheral base addresses */
  #define PORT_BASE_ADDRS                          { PORT_A_BASE, PORT_B_BASE, PORT_C_BASE, PORT_D_BASE }
  /** Array initializer of PORT peripheral base pointers */
  #define PORT_BASE_PTRS                           { PORT_A, PORT_B, PORT_C, PORT_D }
#endif

/* PWM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLEXPWM_0 base address */
  #define FLEXPWM_0_BASE                           (0x50021000u)
  /** Peripheral FLEXPWM_0 base address */
  #define FLEXPWM_0_BASE_NS                        (0x40021000u)
  /** Peripheral FLEXPWM_0 base pointer */
  #define FLEXPWM_0                                ((PWM_Type *)FLEXPWM_0_BASE)
  /** Peripheral FLEXPWM_0 base pointer */
  #define FLEXPWM_0_NS                             ((PWM_Type *)FLEXPWM_0_BASE_NS)
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS                           { FLEXPWM_0_BASE }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS                            { FLEXPWM_0 }
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS_NS                        { FLEXPWM_0_BASE_NS }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS_NS                         { FLEXPWM_0_NS }
#else
  /** Peripheral FLEXPWM_0 base address */
  #define FLEXPWM_0_BASE                           (0x40021000u)
  /** Peripheral FLEXPWM_0 base pointer */
  #define FLEXPWM_0                                ((PWM_Type *)FLEXPWM_0_BASE)
  /** Array initializer of PWM peripheral base addresses */
  #define PWM_BASE_ADDRS                           { FLEXPWM_0_BASE }
  /** Array initializer of PWM peripheral base pointers */
  #define PWM_BASE_PTRS                            { FLEXPWM_0 }
#endif
/** Interrupt vectors for the PWM peripheral type */
#define PWM_FAULT_IRQS                           { FLEXPWM0_FAULT_IRQn }
#define PWM_RELOAD_ERROR_IRQS                    { FLEXPWM0_RELOAD_ERROR_IRQn }

/* RADIO_CTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RADIO_CTRL base address */
  #define RADIO_CTRL_BASE                          (0x50106000u)
  /** Peripheral RADIO_CTRL base address */
  #define RADIO_CTRL_BASE_NS                       (0x40106000u)
  /** Peripheral RADIO_CTRL base pointer */
  #define RADIO_CTRL                               ((RADIO_CTRL_Type *)RADIO_CTRL_BASE)
  /** Peripheral RADIO_CTRL base pointer */
  #define RADIO_CTRL_NS                            ((RADIO_CTRL_Type *)RADIO_CTRL_BASE_NS)
  /** Array initializer of RADIO_CTRL peripheral base addresses */
  #define RADIO_CTRL_BASE_ADDRS                    { RADIO_CTRL_BASE }
  /** Array initializer of RADIO_CTRL peripheral base pointers */
  #define RADIO_CTRL_BASE_PTRS                     { RADIO_CTRL }
  /** Array initializer of RADIO_CTRL peripheral base addresses */
  #define RADIO_CTRL_BASE_ADDRS_NS                 { RADIO_CTRL_BASE_NS }
  /** Array initializer of RADIO_CTRL peripheral base pointers */
  #define RADIO_CTRL_BASE_PTRS_NS                  { RADIO_CTRL_NS }
#else
  /** Peripheral RADIO_CTRL base address */
  #define RADIO_CTRL_BASE                          (0x40106000u)
  /** Peripheral RADIO_CTRL base pointer */
  #define RADIO_CTRL                               ((RADIO_CTRL_Type *)RADIO_CTRL_BASE)
  /** Array initializer of RADIO_CTRL peripheral base addresses */
  #define RADIO_CTRL_BASE_ADDRS                    { RADIO_CTRL_BASE }
  /** Array initializer of RADIO_CTRL peripheral base pointers */
  #define RADIO_CTRL_BASE_PTRS                     { RADIO_CTRL }
#endif

/* RBME - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RBME base address */
  #define RBME_BASE                                (0x50106200u)
  /** Peripheral RBME base address */
  #define RBME_BASE_NS                             (0x40106200u)
  /** Peripheral RBME base pointer */
  #define RBME                                     ((RBME_Type *)RBME_BASE)
  /** Peripheral RBME base pointer */
  #define RBME_NS                                  ((RBME_Type *)RBME_BASE_NS)
  /** Array initializer of RBME peripheral base addresses */
  #define RBME_BASE_ADDRS                          { RBME_BASE }
  /** Array initializer of RBME peripheral base pointers */
  #define RBME_BASE_PTRS                           { RBME }
  /** Array initializer of RBME peripheral base addresses */
  #define RBME_BASE_ADDRS_NS                       { RBME_BASE_NS }
  /** Array initializer of RBME peripheral base pointers */
  #define RBME_BASE_PTRS_NS                        { RBME_NS }
#else
  /** Peripheral RBME base address */
  #define RBME_BASE                                (0x40106200u)
  /** Peripheral RBME base pointer */
  #define RBME                                     ((RBME_Type *)RBME_BASE)
  /** Array initializer of RBME peripheral base addresses */
  #define RBME_BASE_ADDRS                          { RBME_BASE }
  /** Array initializer of RBME peripheral base pointers */
  #define RBME_BASE_PTRS                           { RBME }
#endif

/* REGFILE - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral REGFILE_0 base address */
  #define REGFILE_0_BASE                           (0x5018B000u)
  /** Peripheral REGFILE_0 base address */
  #define REGFILE_0_BASE_NS                        (0x4018B000u)
  /** Peripheral REGFILE_0 base pointer */
  #define REGFILE_0                                ((REGFILE_Type *)REGFILE_0_BASE)
  /** Peripheral REGFILE_0 base pointer */
  #define REGFILE_0_NS                             ((REGFILE_Type *)REGFILE_0_BASE_NS)
  /** Array initializer of REGFILE peripheral base addresses */
  #define REGFILE_BASE_ADDRS                       { REGFILE_0_BASE }
  /** Array initializer of REGFILE peripheral base pointers */
  #define REGFILE_BASE_PTRS                        { REGFILE_0 }
  /** Array initializer of REGFILE peripheral base addresses */
  #define REGFILE_BASE_ADDRS_NS                    { REGFILE_0_BASE_NS }
  /** Array initializer of REGFILE peripheral base pointers */
  #define REGFILE_BASE_PTRS_NS                     { REGFILE_0_NS }
#else
  /** Peripheral REGFILE_0 base address */
  #define REGFILE_0_BASE                           (0x4018B000u)
  /** Peripheral REGFILE_0 base pointer */
  #define REGFILE_0                                ((REGFILE_Type *)REGFILE_0_BASE)
  /** Array initializer of REGFILE peripheral base addresses */
  #define REGFILE_BASE_ADDRS                       { REGFILE_0_BASE }
  /** Array initializer of REGFILE peripheral base pointers */
  #define REGFILE_BASE_PTRS                        { REGFILE_0 }
#endif

/* RFMC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RFMC base address */
  #define RFMC_BASE                                (0x501A3000u)
  /** Peripheral RFMC base address */
  #define RFMC_BASE_NS                             (0x401A3000u)
  /** Peripheral RFMC base pointer */
  #define RFMC                                     ((RFMC_Type *)RFMC_BASE)
  /** Peripheral RFMC base pointer */
  #define RFMC_NS                                  ((RFMC_Type *)RFMC_BASE_NS)
  /** Array initializer of RFMC peripheral base addresses */
  #define RFMC_BASE_ADDRS                          { RFMC_BASE }
  /** Array initializer of RFMC peripheral base pointers */
  #define RFMC_BASE_PTRS                           { RFMC }
  /** Array initializer of RFMC peripheral base addresses */
  #define RFMC_BASE_ADDRS_NS                       { RFMC_BASE_NS }
  /** Array initializer of RFMC peripheral base pointers */
  #define RFMC_BASE_PTRS_NS                        { RFMC_NS }
#else
  /** Peripheral RFMC base address */
  #define RFMC_BASE                                (0x401A3000u)
  /** Peripheral RFMC base pointer */
  #define RFMC                                     ((RFMC_Type *)RFMC_BASE)
  /** Array initializer of RFMC peripheral base addresses */
  #define RFMC_BASE_ADDRS                          { RFMC_BASE }
  /** Array initializer of RFMC peripheral base pointers */
  #define RFMC_BASE_PTRS                           { RFMC }
#endif

/* RF_CMC1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RF_CMC1 base address */
  #define RF_CMC1_BASE                             (0x50203000u)
  /** Peripheral RF_CMC1 base address */
  #define RF_CMC1_BASE_NS                          (0x40203000u)
  /** Peripheral RF_CMC1 base pointer */
  #define RF_CMC1                                  ((RF_CMC1_Type *)RF_CMC1_BASE)
  /** Peripheral RF_CMC1 base pointer */
  #define RF_CMC1_NS                               ((RF_CMC1_Type *)RF_CMC1_BASE_NS)
  /** Array initializer of RF_CMC1 peripheral base addresses */
  #define RF_CMC1_BASE_ADDRS                       { RF_CMC1_BASE }
  /** Array initializer of RF_CMC1 peripheral base pointers */
  #define RF_CMC1_BASE_PTRS                        { RF_CMC1 }
  /** Array initializer of RF_CMC1 peripheral base addresses */
  #define RF_CMC1_BASE_ADDRS_NS                    { RF_CMC1_BASE_NS }
  /** Array initializer of RF_CMC1 peripheral base pointers */
  #define RF_CMC1_BASE_PTRS_NS                     { RF_CMC1_NS }
#else
  /** Peripheral RF_CMC1 base address */
  #define RF_CMC1_BASE                             (0x40203000u)
  /** Peripheral RF_CMC1 base pointer */
  #define RF_CMC1                                  ((RF_CMC1_Type *)RF_CMC1_BASE)
  /** Array initializer of RF_CMC1 peripheral base addresses */
  #define RF_CMC1_BASE_ADDRS                       { RF_CMC1_BASE }
  /** Array initializer of RF_CMC1 peripheral base pointers */
  #define RF_CMC1_BASE_PTRS                        { RF_CMC1 }
#endif

/* RTC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SRTC_0 base address */
  #define SRTC_0_BASE                              (0x50189000u)
  /** Peripheral SRTC_0 base address */
  #define SRTC_0_BASE_NS                           (0x40189000u)
  /** Peripheral SRTC_0 base pointer */
  #define SRTC_0                                   ((RTC_Type *)SRTC_0_BASE)
  /** Peripheral SRTC_0 base pointer */
  #define SRTC_0_NS                                ((RTC_Type *)SRTC_0_BASE_NS)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { SRTC_0_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { SRTC_0 }
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS_NS                        { SRTC_0_BASE_NS }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS_NS                         { SRTC_0_NS }
#else
  /** Peripheral SRTC_0 base address */
  #define SRTC_0_BASE                              (0x40189000u)
  /** Peripheral SRTC_0 base pointer */
  #define SRTC_0                                   ((RTC_Type *)SRTC_0_BASE)
  /** Array initializer of RTC peripheral base addresses */
  #define RTC_BASE_ADDRS                           { SRTC_0_BASE }
  /** Array initializer of RTC peripheral base pointers */
  #define RTC_BASE_PTRS                            { SRTC_0 }
#endif
/** Interrupt vectors for the RTC peripheral type */
#define RTC_IRQS                                 { RTC_Alarm_IRQn }
#define RTC_SECONDS_IRQS                         { RTC_Seconds_IRQn }

/* RTU - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RTU base address */
  #define RTU_BASE                                 (0x5010B400u)
  /** Peripheral RTU base address */
  #define RTU_BASE_NS                              (0x4010B400u)
  /** Peripheral RTU base pointer */
  #define RTU                                      ((RTU_Type *)RTU_BASE)
  /** Peripheral RTU base pointer */
  #define RTU_NS                                   ((RTU_Type *)RTU_BASE_NS)
  /** Array initializer of RTU peripheral base addresses */
  #define RTU_BASE_ADDRS                           { RTU_BASE }
  /** Array initializer of RTU peripheral base pointers */
  #define RTU_BASE_PTRS                            { RTU }
  /** Array initializer of RTU peripheral base addresses */
  #define RTU_BASE_ADDRS_NS                        { RTU_BASE_NS }
  /** Array initializer of RTU peripheral base pointers */
  #define RTU_BASE_PTRS_NS                         { RTU_NS }
#else
  /** Peripheral RTU base address */
  #define RTU_BASE                                 (0x4010B400u)
  /** Peripheral RTU base pointer */
  #define RTU                                      ((RTU_Type *)RTU_BASE)
  /** Array initializer of RTU peripheral base addresses */
  #define RTU_BASE_ADDRS                           { RTU_BASE }
  /** Array initializer of RTU peripheral base pointers */
  #define RTU_BASE_PTRS                            { RTU }
#endif

